# আমরা পাইথনের চার ধরনের ডাটা স্ট্রাকচার শিখব: লিস্ট, টাপল, সেট ও ডিকশনারি।
a=[]
print(a)
print(type(a))
b=['onion','potato','ginger','cucumber',1,3.1416]
b[0]="rice"
print(b)
print('')

# append() ফাংশন। এই ফাংশন ব্যবহার করে আমরা আমাদের লিস্টে যেকোন নতুন আইটেম ঢোকাতে পারি। দেখা যাক:
b.append('new')
print(b) 
# insert() ফাংশনটা ব্যবহার করতে হবে। এই ফাংশনের ভিতর আমাদের নতুন আইটেমটা যে ইনডেক্সে আমরা বসাতে চাই সেটার নম্বর
# আর নতুন আইটেমটা বলে দিতে হবে। 
b.insert(1,'python')
print(b)
# একাধিক আইটেম একসাথে যোগ করার জন্য আমাদেরকে extend() ফাংশন ব্যবহার করতে হবে
b.extend(['okay','fine','good'])
print(b)
print('')

l=['a','b']
m=['c','d']
n=['e','f']

print(l+m+n)
print('')

#লিস্ট থেকে আইটেম রিমুভ করার জন্য দুইটা জুতসই পদ্ধতি আছে। 
# আমরা যে আইটেমটা রিমুভ করতে চাই সেটার ইনডেক্স নম্বর যদি আমরা জানি তবে del স্টেটমেন্ট ব্যবহার করতে পারি। 
# আর যদি না জানি সেক্ষেত্রে remove() ফাংশনটা চমৎকার কাজ করবে।
print(b)
del b[3]
print(b)
b.remove(b[2])
print(b)
del b[-1]
print(b)
#del b[-1] স্টেটমেন্টটা বুঝতেছি না তাদের জন্য বলছি। এটা দ্বারা বুঝায় শেষ দিক থেকে প্রথমটা। তবে আমরা চাইলে কিন্তু আরো সহজে এই কাজটা করতে পারি। এজন্য আপনাকে pop() ফাংশনের সাহায্য নিতে হবে। 
# এই ফাংশনের কাজ হল লিস্টের একেবারে শেষ আইটেমটা রিমুভ করে আউটপুট দেয়া বা রিটার্ন করা। 
b.pop()
print(b)
print('')

# লিস্টে ঠিক কতগুলো আইটেম রয়েছে তা জানার জন্য আমরা len() ফাংশনটা ব্যবহার করতে পারি।
print(len(b))
print('')

# count() ফাংশনের ব্যবহার। এই ফাংশনের ভিতর কোন আইটেম দিয়ে দেয়া হলে এটা আমাদেরকে ঐ আইটেমেটা কতবার আছে তা জানিয়ে দেয়
print(b.count('rice'))
c=['potato','a','b','potato','potato']
print(c)
print(c.count('potato'))
print('')

# লিস্টকে উল্টানোর বা রিভার্স করার দরকার হতে পারে। এজন্য আমরা reverse() ফাংশন ব্যবহার করতে পারি।
print(b)
b.reverse()
print(b)
print('')

# লিস্টে যদি শুধু স্ট্রিং বা সংখ্যাই থাকে তবে আমরা তাদেরকে সুন্দরভাবে সাজাতে পারি। এজন্য আমরা sort() ফাংশন ব্যবহার করব।
a=[8,3,5,1,6,2,9,7,0,4]
print(a)
a.sort()
print("shorted list :",a)
c=['b','c','a',':','maateen']
print(c)
c.sort()
print(c)
