# ডিকশনারিতে সবগুলো আইটেম কমার (,) মাধ্যমে একে অপর থেকে আলাদা থাকে। 
# প্রতিটা আইটেমে তিনটা অংশ থাকে। প্রথম অংশে থাকে কী, মাঝের অংশে থাকে
# কোলন চিহ্ন (:) সেপারেটর হিসেবে আর শেষাংশে থাকে ভ্যালু। একটা ডিকশনারির 
# প্রতিটা কী ইউনিক হবে, একটার সাথে অপরটা মিলতে পারবে না। তবে একই ভ্যালু কয়েকবার থাকতে পারে।
a={}
a=dict()
print(a)
print(type(a))
a={
    'name':'MD. Maksudur Rahman Khan',
    'nickname':'Maateen',
    'email':'maateen@outlook.com',
    'phone':'01711223344'
}
print(a)
print(type(a))

'''অ্যাক্সেস আইটেম #
লিস্টের মত করেই ডিকশনারির আইটেম অ্যাক্সেস করা যায়।
পার্থক্য হল, লিস্টের ক্ষেত্রে [] এর ভিতর ইনডেক্স নম্বর ব্যবহার করতে হয়
আর ডিকশনারির ক্ষেত্রে কী ব্যবহার করতে হবে।'''
print(a['name'])
print(a['email'])
print(a['phone'])

# ডিকশনারির কোন আইটেমকে আপডেট করা খুবই সহজ কাজ।
# শুধু ঐ কী তে নতুন ডাটা অ্যাসাইন করলেই চলে
a['name']='MD. Shehab Sarker'
print(a)

# নতুন একটা আইটেম যোগ করতে চাইলে নতুন একটা কী-ভ্যালু পেয়ার যোগ করলেই হয়।
a['hometown']='Barishal'
print(a)

#যদি কখনো একটা ডিকশনারির সব আইটেমকে অন্য একটা ডিকশনারিতে যোগ করার 
# দরকার পরে? তখন আমরা update() ফাংশনটা ব্যবহার করব
b={
    "city":'Dhaka',
    'fav_poet':'Nazrul'
}
b.update(a)
print(b)
print('')

#  ডিকশনারির সবগুলো আইটেমকে এক ঝটকায় 
# রিমুভ করে ফেলতে চাই clear() ফাংশনটা কাজের জিনিস।
a.clear()
print(a)
x=b.copy
print(x)

# get(key, default=None) এই ফাংশনটা মূলত স্ট্রিংয়ে কোন কী সার্চ করে সেটার 
# ভ্যালু পাবার জন্য ব্যবহার করা হয়। যদি কী ডিকশনারিতে না থাকে তবে একটা 
# ডিফল্ট ভ্যালু রিটার্ন করবে।
print(b.get('city'))
print(a.get('home4'))
print('')

# has_key(key) কোন ডিকশনারিতে কোন নির্দিষ্ট কী আছে কিনা সেটা পরীক্ষা করার জন্য আমরা 
# এই ফাংশনটা ব্যবহার করতে পারি। যদি কীটা থাকে তবে True রিটার্ন করবে, না থাকলে False রিটার্ন করবে। 
# তবে আফসোসের কথা হল, এটাকে বাদ দিয়ে দেয়া হয়েছে
print("city" in b)
print('home'in b)
print('')

# tems() এই ফাংশনটা একটা ডিকশনারিকে লিস্ট হিসাবে রিটার্ন করে। লিস্টের ভিতর প্রতিটা আইটেম টাপল 
# হিসাবে থাকে। প্রতিটা টাপলের 0 নম্বর ইনডেক্সে থাকে কী আর 1 নম্বর ইনডেক্সে থাকে ভ্যালু।
print(b.items())
print('')

# keys()এই ফাংশনটা একটা ডিকশনারির সবগুলো কী লিস্ট হিসাবে রিটার্ন করে।
print(b.keys())
print('')

# values() এই ফাংশনটা একটা ডিকশনারির সবগুলো ভ্যালু লিস্ট হিসাবে রিটার্ন করে।
print(b.values())